cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    # optional if you want the variable to be nil
    # @cat = Cat.find_by(id: params[:id])
    @cat = Cat.find(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Samantha"], ["description", "    go to cat\r\n  "], ["updated_at", "2018-10-16 21:31:20.708025"], ["id", 10]]
---
  def update
    cat = Cat.find(params[:id])
    if cat.update(cat_params)

INSERT INTO "cats" ("birth_date", "color", "name", "description", "created_at", "updated_at", "sex") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["birth_date", "2018-10-09"], ["color", "grey"], ["name", "Jerry"], ["description", "hi"], ["created_at", "2018-10-16 21:14:32.909055"], ["updated_at", "2018-10-16 21:14:32.909055"], ["sex", "F"]]
---
  def create
    @cat = Cat.new(cat_params)
    if @cat.save